MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
extern volatile RXF2EID8bits_t RXF2EID8bits __at(0xF0A);
// bitfield macros
#define _RXF2EID8_EID8_POSN                                 0x0
#define _RXF2EID8_EID8_POSITION                             0x0
#define _RXF2EID8_EID8_SIZE                                 0x1
#define _RXF2EID8_EID8_LENGTH                               0x1
#define _RXF2EID8_EID8_MASK                                 0x1
#define _RXF2EID8_EID9_POSN                                 0x1
#define _RXF2EID8_EID9_POSITION                             0x1
#define _RXF2EID8_EID9_SIZE                                 0x1
#define _RXF2EID8_EID9_LENGTH                               0x1
#define _RXF2EID8_EID9_MASK                                 0x2
#define _RXF2EID8_EID10_POSN                                0x2
#define _RXF2EID8_EID10_POSITION                            0x2
#define _RXF2EID8_EID10_SIZE                                0x1
#define _RXF2EID8_EID10_LENGTH                              0x1
#define _RXF2EID8_EID10_MASK                                0x4
#define _RXF2EID8_EID11_POSN                                0x3
#define _RXF2EID8_EID11_POSITION                            0x3
#define _RXF2EID8_EID11_SIZE                                0x1
#define _RXF2EID8_EID11_LENGTH                              0x1
#define _RXF2EID8_EID11_MASK                                0x8
#define _RXF2EID8_EID12_POSN                                0x4
#define _RXF2EID8_EID12_POSITION                            0x4
#define _RXF2EID8_EID12_SIZE                                0x1
#define _RXF2EID8_EID12_LENGTH                              0x1
#define _RXF2EID8_EID12_MASK                                0x10
#define _RXF2EID8_EID13_POSN                                0x5
#define _RXF2EID8_EID13_POSITION                            0x5
#define _RXF2EID8_EID13_SIZE                                0x1
#define _RXF2EID8_EID13_LENGTH                              0x1
#define _RXF2EID8_EID13_MASK                                0x20
#define _RXF2EID8_EID14_POSN                                0x6
#define _RXF2EID8_EID14_POSITION                            0x6
#define _RXF2EID8_EID14_SIZE                                0x1
#define _RXF2EID8_EID14_LENGTH                              0x1
#define _RXF2EID8_EID14_MASK                                0x40
#define _RXF2EID8_EID15_POSN                                0x7
#define _RXF2EID8_EID15_POSITION                            0x7
#define _RXF2EID8_EID15_SIZE                                0x1
#define _RXF2EID8_EID15_LENGTH                              0x1
#define _RXF2EID8_EID15_MASK                                0x80
#define _RXF2EID8_RXF2EID8_POSN                             0x0
#define _RXF2EID8_RXF2EID8_POSITION                         0x0
#define _RXF2EID8_RXF2EID8_SIZE                             0x1
#define _RXF2EID8_RXF2EID8_LENGTH                           0x1
#define _RXF2EID8_RXF2EID8_MASK                             0x1
#define _RXF2EID8_RXF2EID9_POSN                             0x1
#define _RXF2EID8_RXF2EID9_POSITION                         0x1
#define _RXF2EID8_RXF2EID9_SIZE                             0x1
#define _RXF2EID8_RXF2EID9_LENGTH                           0x1
#define _RXF2EID8_RXF2EID9_MASK                             0x2
#define _RXF2EID8_RXF2EID10_POSN                            0x2
#define _RXF2EID8_RXF2EID10_POSITION                        0x2
#define _RXF2EID8_RXF2EID10_SIZE                            0x1
#define _RXF2EID8_RXF2EID10_LENGTH                          0x1
#define _RXF2EID8_RXF2EID10_MASK                            0x4
#define _RXF2EID8_RXF2EID11_POSN                            0x3
#define _RXF2EID8_RXF2EID11_POSITION                        0x3
#define _RXF2EID8_RXF2EID11_SIZE                            0x1
#define _RXF2EID8_RXF2EID11_LENGTH                          0x1
#define _RXF2EID8_RXF2EID11_MASK                            0x8
#define _RXF2EID8_RXF2EID12_POSN                            0x4
#define _RXF2EID8_RXF2EID12_POSITION                        0x4
#define _RXF2EID8_RXF2EID12_SIZE                            0x1
#define _RXF2EID8_RXF2EID12_LENGTH                          0x1
#define _RXF2EID8_RXF2EID12_MASK                            0x10
#define _RXF2EID8_RXF2EID13_POSN                            0x5
#define _RXF2EID8_RXF2EID13_POSITION                        0x5
#define _RXF2EID8_RXF2EID13_SIZE                            0x1
#define _RXF2EID8_RXF2EID13_LENGTH                          0x1
#define _RXF2EID8_RXF2EID13_MASK                            0x20
#define _RXF2EID8_RXF2EID14_POSN                            0x6
#define _RXF2EID8_RXF2EID14_POSITION                        0x6
#define _RXF2EID8_RXF2EID14_SIZE                            0x1
#define _RXF2EID8_RXF2EID14_LENGTH                          0x1
#define _RXF2EID8_RXF2EID14_MASK                            0x40
#define _RXF2EID8_RXF2EID15_POSN                            0x7
#define _RXF2EID8_RXF2EID15_POSITION                        0x7
#define _RXF2EID8_RXF2EID15_SIZE                            0x1
#define _RXF2EID8_RXF2EID15_LENGTH                          0x1
#define _RXF2EID8_RXF2EID15_MASK                            0x80

// Register: RXF2EIDL
#define RXF2EIDL RXF2EIDL
extern volatile unsigned char           RXF2EIDL            __at(0xF0B);
#ifndef _LIB_BUILD
asm("RXF2EIDL equ 0F0Bh");
#endif
// aliases
extern volatile unsigned char           RXF2EID0            __at(0xF0B);
#ifndef _LIB_BUILD
asm("RXF2EID0 equ 0F0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF2EID0               :1;
        unsigned RXF2EID1               :1;
        unsigned RXF2EID2               :1;
        unsigned RXF2EID3               :1;
        unsigned RXF2EID4               :1;
        unsigned RXF2EID5               :1;
        unsigned RXF2EID6               :1;
        unsigned RXF2EID7               :1;
    };
} RXF2EIDLbits_t;
extern volatile RXF2EIDLbits_t RXF2EIDLbits __at(0xF0B);
// bitfield macros
#define _RXF2EIDL_EID0_POSN                                 0x0
#define _RXF2EIDL_EID0_POSITION                             0x0
#define _RXF2EIDL_EID0_SIZE                                 0x1
#define _RXF2EIDL_EID0_LENGTH                               0x1
#define _RXF2EIDL_EID0_MASK                                 0x1
#define _RXF2EIDL_EID1_POSN                                 0x1
#define _RXF2EIDL_EID1_POSITION                             0x1
#define _RXF2EIDL_EID1_SIZE                                 0x1
#define _RXF2EIDL_EID1_LENGTH                               0x1
#define _RXF2EIDL_EID1_MASK                                 0x2
#define _RXF2EIDL_EID2_POSN                                 0x2
#define _RXF2EIDL_EID2_POSITION                             0x2
#define _RXF2EIDL_EID2_SIZE                                 0x1
#define _RXF2EIDL_EID2_LENGTH                               0x1
#define _RXF2EIDL_EID2_MASK                                 0x4
#define _RXF2EIDL_EID3_POSN                                 0x3
#define _RXF2EIDL_EID3_POSITION                             0x3
#define _RXF2EIDL_EID3_SIZE                                 0x1
#define _RXF2EIDL_EID3_LENGTH                               0x1
#define _RXF2EIDL_EID3_MASK                                 0x8
#define _RXF2EIDL_EID4_POSN                                 0x4
#define _RXF2EIDL_EID4_POSITION                             0x4
#define _RXF2EIDL_EID4_SIZE                                 0x1
#define _RXF2EIDL_EID4_LENGTH                               0x1
#define _RXF2EIDL_EID4_MASK                                 0x10
#define _RXF2EIDL_EID5_POSN                                 0x5
#define _RXF2EIDL_EID5_POSITION                             0x5
#define _RXF2EIDL_EID5_SIZE                                 0x1
#define _RXF2EIDL_EID5_LENGTH                               0x1
#define _RXF2EIDL_EID5_MASK                                 0x20
#define _RXF2EIDL_EID6_POSN                                 0x6
#define _RXF2EIDL_EID6_POSITION                             0x6
#define _RXF2EIDL_EID6_SIZE                                 0x1
#define _RXF2EIDL_EID6_LENGTH                               0x1
#define _RXF2EIDL_EID6_MASK                                 0x40
#define _RXF2EIDL_EID7_POSN                                 0x7
#define _RXF2EIDL_EID7_POSITION                             0x7
#define _RXF2EIDL_EID7_SIZE                                 0x1
#define _RXF2EIDL_EID7_LENGTH                               0x1
#define _RXF2EIDL_EID7_MASK                                 0x80
#define _RXF2EIDL_RXF2EID0_POSN                             0x0
#define _RXF2EIDL_RXF2EID0_POSITION                         0x0
#define _RXF2EIDL_RXF2EID0_SIZE                             0x1
#define _RXF2EIDL_RXF2EID0_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID0_MASK                             0x1
#define _RXF2EIDL_RXF2EID1_POSN                             0x1
#define _RXF2EIDL_RXF2EID1_POSITION                         0x1
#define _RXF2EIDL_RXF2EID1_SIZE                             0x1
#define _RXF2EIDL_RXF2EID1_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID1_MASK                             0x2
#define _RXF2EIDL_RXF2EID2_POSN                             0x2
#define _RXF2EIDL_RXF2EID2_POSITION                         0x2
#define _RXF2EIDL_RXF2EID2_SIZE                             0x1
#define _RXF2EIDL_RXF2EID2_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID2_MASK                             0x4
#define _RXF2EIDL_RXF2EID3_POSN                             0x3
#define _RXF2EIDL_RXF2EID3_POSITION                         0x3
#define _RXF2EIDL_RXF2EID3_SIZE                             0x1
#define _RXF2EIDL_RXF2EID3_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID3_MASK                             0x8
#define _RXF2EIDL_RXF2EID4_POSN                             0x4
#define _RXF2EIDL_RXF2EID4_POSITION                         0x4
#define _RXF2EIDL_RXF2EID4_SIZE                             0x1
#define _RXF2EIDL_RXF2EID4_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID4_MASK                             0x10
#define _RXF2EIDL_RXF2EID5_POSN                             0x5
#define _RXF2EIDL_RXF2EID5_POSITION                         0x5
#define _RXF2EIDL_RXF2EID5_SIZE                             0x1
#define _RXF2EIDL_RXF2EID5_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID5_MASK                             0x20
#define _RXF2EIDL_RXF2EID6_POSN                             0x6
#define _RXF2EIDL_RXF2EID6_POSITION                         0x6
#define _RXF2EIDL_RXF2EID6_SIZE                             0x1
#define _RXF2EIDL_RXF2EID6_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID6_MASK                             0x40
#define _RXF2EIDL_RXF2EID7_POSN                             0x7
#define _RXF2EIDL_RXF2EID7_POSITION                         0x7
#define _RXF2EIDL_RXF2EID7_SIZE                             0x1
#define _RXF2EIDL_RXF2EID7_LENGTH                           0x1
#define _RXF2EIDL_RXF2EID7_MASK                             0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF2EID0               :1;
        unsigned RXF2EID1               :1;
        unsigned RXF2EID2               :1;
        unsigned RXF2EID3               :1;
        unsigned RXF2EID4               :1;
        unsigned RXF2EID5               :1;
        unsigned RXF2EID6               :1;
        unsigned RXF2EID7               :1;
    };
} RXF2EID0bits_t;
extern volatile RXF2EID0bits_t RXF2EID0bits __at(0xF0B);
// bitfield macros
#define _RXF2EID0_EID0_POSN                                 0x0
#define _RXF2EID0_EID0_POSITION                             0x0
#define _RXF2EID0_EID0_SIZE                                 0x1
#define _RXF2EID0_EID0_LENGTH                               0x1
#define _RXF2EID0_EID0_MASK                                 0x1
#define _RXF2EID0_EID1_POSN                                 0x1
#define _RXF2EID0_EID1_POSITION                             0x1
#define _RXF2EID0_EID1_SIZE                                 0x1
#define _RXF2EID0_EID1_LENGTH                               0x1
#define _RXF2EID0_EID1_MASK                                 0x2
#define _RXF2EID0_EID2_POSN                                 0x2
#define _RXF2EID0_EID2_POSITION                             0x2
#define _RXF2EID0_EID2_SIZE                                 0x1
#define _RXF2EID0_EID2_LENGTH                               0x1
#define _RXF2EID0_EID2_MASK                                 0x4
#define _RXF2EID0_EID3_POSN                                 0x3
#define _RXF2EID0_EID3_POSITION                             0x3
#define _RXF2EID0_EID3_SIZE                                 0x1
#define _RXF2EID0_EID3_LENGTH                               0x1
#define _RXF2EID0_EID3_MASK                                 0x8
#define _RXF2EID0_EID4_POSN                                 0x4
#define _RXF2EID0_EID4_POSITION                             0x4
#define _RXF2EID0_EID4_SIZE                                 0x1
#define _RXF2EID0_EID4_LENGTH                               0x1
#define _RXF2EID0_EID4_MASK                                 0x10
#define _RXF2EID0_EID5_POSN                                 0x5
#define _RXF2EID0_EID5_POSITION                             0x5
#define _RXF2EID0_EID5_SIZE                                 0x1
#define _RXF2EID0_EID5_LENGTH                               0x1
#define _RXF2EID0_EID5_MASK                                 0x20
#define _RXF2EID0_EID6_POSN                                 0x6
#define _RXF2EID0_EID6_POSITION                             0x6
#define _RXF2EID0_EID6_SIZE                                 0x1
#define _RXF2EID0_EID6_LENGTH                               0x1
#define _RXF2EID0_EID6_MASK                                 0x40
#define _RXF2EID0_EID7_POSN                                 0x7
#define _RXF2EID0_EID7_POSITION                             0x7
#define _RXF2EID0_EID7_SIZE                                 0x1
#define _RXF2EID0_EID7_LENGTH                               0x1
#define _RXF2EID0_EID7_MASK                                 0x80
#define _RXF2EID0_RXF2EID0_POSN                             0x0
#define _RXF2EID0_RXF2EID0_POSITION                         0x0
#define _RXF2EID0_RXF2EID0_SIZE                             0x1
#define _RXF2EID0_RXF2EID0_LENGTH                           0x1
#define _RXF2EID0_RXF2EID0_MASK                             0x1
#define _RXF2EID0_RXF2EID1_POSN                             0x1
#define _RXF2EID0_RXF2EID1_POSITION                         0x1
#define _RXF2EID0_RXF2EID1_SIZE                             0x1
#define _RXF2EID0_RXF2EID1_LENGTH                           0x1
#define _RXF2EID0_RXF2EID1_MASK                             0x2
#define _RXF2EID0_RXF2EID2_POSN                             0x2
#define _RXF2EID0_RXF2EID2_POSITION                         0x2
#define _RXF2EID0_RXF2EID2_SIZE                             0x1
#define _RXF2EID0_RXF2EID2_LENGTH                           0x1
#define _RXF2EID0_RXF2EID2_MASK                             0x4
#define _RXF2EID0_RXF2EID3_POSN                             0x3
#define _RXF2EID0_RXF2EID3_POSITION                         0x3
#define _RXF2EID0_RXF2EID3_SIZE                             0x1
#define _RXF2EID0_RXF2EID3_LENGTH                           0x1
#define _RXF2EID0_RXF2EID3_MASK                             0x8
#define _RXF2EID0_RXF2EID4_POSN                             0x4
#define _RXF2EID0_RXF2EID4_POSITION                         0x4
#define _RXF2EID0_RXF2EID4_SIZE                             0x1
#define _RXF2EID0_RXF2EID4_LENGTH                           0x1
#define _RXF2EID0_RXF2EID4_MASK                             0x10
#define _RXF2EID0_RXF2EID5_POSN                             0x5
#define _RXF2EID0_RXF2EID5_POSITION                         0x5
#define _RXF2EID0_RXF2EID5_SIZE                             0x1
#define _RXF2EID0_RXF2EID5_LENGTH                           0x1
#define _RXF2EID0_RXF2EID5_MASK                             0x20
#define _RXF2EID0_RXF2EID6_POSN                             0x6
#define _RXF2EID0_RXF2EID6_POSITION                         0x6
#define _RXF2EID0_RXF2EID6_SIZE                             0x1
#define _RXF2EID0_RXF2EID6_LENGTH                           0x1
#define _RXF2EID0_RXF2EID6_MASK                             0x40
#define _RXF2EID0_RXF2EID7_POSN                             0x7
#define _RXF2EID0_RXF2EID7_POSITION                         0x7
#define _RXF2EID0_RXF2EID7_SIZE                             0x1
#define _RXF2EID0_RXF2EID7_LENGTH                           0x1
#define _RXF2EID0_RXF2EID7_MASK                             0x80

