MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
extern volatile RXF3EID8bits_t RXF3EID8bits __at(0xF0E);
// bitfield macros
#define _RXF3EID8_EID8_POSN                                 0x0
#define _RXF3EID8_EID8_POSITION                             0x0
#define _RXF3EID8_EID8_SIZE                                 0x1
#define _RXF3EID8_EID8_LENGTH                               0x1
#define _RXF3EID8_EID8_MASK                                 0x1
#define _RXF3EID8_EID9_POSN                                 0x1
#define _RXF3EID8_EID9_POSITION                             0x1
#define _RXF3EID8_EID9_SIZE                                 0x1
#define _RXF3EID8_EID9_LENGTH                               0x1
#define _RXF3EID8_EID9_MASK                                 0x2
#define _RXF3EID8_EID10_POSN                                0x2
#define _RXF3EID8_EID10_POSITION                            0x2
#define _RXF3EID8_EID10_SIZE                                0x1
#define _RXF3EID8_EID10_LENGTH                              0x1
#define _RXF3EID8_EID10_MASK                                0x4
#define _RXF3EID8_EID11_POSN                                0x3
#define _RXF3EID8_EID11_POSITION                            0x3
#define _RXF3EID8_EID11_SIZE                                0x1
#define _RXF3EID8_EID11_LENGTH                              0x1
#define _RXF3EID8_EID11_MASK                                0x8
#define _RXF3EID8_EID12_POSN                                0x4
#define _RXF3EID8_EID12_POSITION                            0x4
#define _RXF3EID8_EID12_SIZE                                0x1
#define _RXF3EID8_EID12_LENGTH                              0x1
#define _RXF3EID8_EID12_MASK                                0x10
#define _RXF3EID8_EID13_POSN                                0x5
#define _RXF3EID8_EID13_POSITION                            0x5
#define _RXF3EID8_EID13_SIZE                                0x1
#define _RXF3EID8_EID13_LENGTH                              0x1
#define _RXF3EID8_EID13_MASK                                0x20
#define _RXF3EID8_EID14_POSN                                0x6
#define _RXF3EID8_EID14_POSITION                            0x6
#define _RXF3EID8_EID14_SIZE                                0x1
#define _RXF3EID8_EID14_LENGTH                              0x1
#define _RXF3EID8_EID14_MASK                                0x40
#define _RXF3EID8_EID15_POSN                                0x7
#define _RXF3EID8_EID15_POSITION                            0x7
#define _RXF3EID8_EID15_SIZE                                0x1
#define _RXF3EID8_EID15_LENGTH                              0x1
#define _RXF3EID8_EID15_MASK                                0x80
#define _RXF3EID8_RXF3EID8_POSN                             0x0
#define _RXF3EID8_RXF3EID8_POSITION                         0x0
#define _RXF3EID8_RXF3EID8_SIZE                             0x1
#define _RXF3EID8_RXF3EID8_LENGTH                           0x1
#define _RXF3EID8_RXF3EID8_MASK                             0x1
#define _RXF3EID8_RXF3EID9_POSN                             0x1
#define _RXF3EID8_RXF3EID9_POSITION                         0x1
#define _RXF3EID8_RXF3EID9_SIZE                             0x1
#define _RXF3EID8_RXF3EID9_LENGTH                           0x1
#define _RXF3EID8_RXF3EID9_MASK                             0x2
#define _RXF3EID8_RXF3EID10_POSN                            0x2
#define _RXF3EID8_RXF3EID10_POSITION                        0x2
#define _RXF3EID8_RXF3EID10_SIZE                            0x1
#define _RXF3EID8_RXF3EID10_LENGTH                          0x1
#define _RXF3EID8_RXF3EID10_MASK                            0x4
#define _RXF3EID8_RXF3EID11_POSN                            0x3
#define _RXF3EID8_RXF3EID11_POSITION                        0x3
#define _RXF3EID8_RXF3EID11_SIZE                            0x1
#define _RXF3EID8_RXF3EID11_LENGTH                          0x1
#define _RXF3EID8_RXF3EID11_MASK                            0x8
#define _RXF3EID8_RXF3EID12_POSN                            0x4
#define _RXF3EID8_RXF3EID12_POSITION                        0x4
#define _RXF3EID8_RXF3EID12_SIZE                            0x1
#define _RXF3EID8_RXF3EID12_LENGTH                          0x1
#define _RXF3EID8_RXF3EID12_MASK                            0x10
#define _RXF3EID8_RXF3EID13_POSN                            0x5
#define _RXF3EID8_RXF3EID13_POSITION                        0x5
#define _RXF3EID8_RXF3EID13_SIZE                            0x1
#define _RXF3EID8_RXF3EID13_LENGTH                          0x1
#define _RXF3EID8_RXF3EID13_MASK                            0x20
#define _RXF3EID8_RXF3EID14_POSN                            0x6
#define _RXF3EID8_RXF3EID14_POSITION                        0x6
#define _RXF3EID8_RXF3EID14_SIZE                            0x1
#define _RXF3EID8_RXF3EID14_LENGTH                          0x1
#define _RXF3EID8_RXF3EID14_MASK                            0x40
#define _RXF3EID8_RXF3EID15_POSN                            0x7
#define _RXF3EID8_RXF3EID15_POSITION                        0x7
#define _RXF3EID8_RXF3EID15_SIZE                            0x1
#define _RXF3EID8_RXF3EID15_LENGTH                          0x1
#define _RXF3EID8_RXF3EID15_MASK                            0x80

// Register: RXF3EIDL
#define RXF3EIDL RXF3EIDL
extern volatile unsigned char           RXF3EIDL            __at(0xF0F);
#ifndef _LIB_BUILD
asm("RXF3EIDL equ 0F0Fh");
#endif
// aliases
extern volatile unsigned char           RXF3EID0            __at(0xF0F);
#ifndef _LIB_BUILD
asm("RXF3EID0 equ 0F0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF3EID0               :1;
        unsigned RXF3EID1               :1;
        unsigned RXF3EID2               :1;
        unsigned RXF3EID3               :1;
        unsigned RXF3EID4               :1;
        unsigned RXF3EID5               :1;
        unsigned RXF3EID6               :1;
        unsigned RXF3EID7               :1;
    };
} RXF3EIDLbits_t;
extern volatile RXF3EIDLbits_t RXF3EIDLbits __at(0xF0F);
// bitfield macros
#define _RXF3EIDL_EID0_POSN                                 0x0
#define _RXF3EIDL_EID0_POSITION                             0x0
#define _RXF3EIDL_EID0_SIZE                                 0x1
#define _RXF3EIDL_EID0_LENGTH                               0x1
#define _RXF3EIDL_EID0_MASK                                 0x1
#define _RXF3EIDL_EID1_POSN                                 0x1
#define _RXF3EIDL_EID1_POSITION                             0x1
#define _RXF3EIDL_EID1_SIZE                                 0x1
#define _RXF3EIDL_EID1_LENGTH                               0x1
#define _RXF3EIDL_EID1_MASK                                 0x2
#define _RXF3EIDL_EID2_POSN                                 0x2
#define _RXF3EIDL_EID2_POSITION                             0x2
#define _RXF3EIDL_EID2_SIZE                                 0x1
#define _RXF3EIDL_EID2_LENGTH                               0x1
#define _RXF3EIDL_EID2_MASK                                 0x4
#define _RXF3EIDL_EID3_POSN                                 0x3
#define _RXF3EIDL_EID3_POSITION                             0x3
#define _RXF3EIDL_EID3_SIZE                                 0x1
#define _RXF3EIDL_EID3_LENGTH                               0x1
#define _RXF3EIDL_EID3_MASK                                 0x8
#define _RXF3EIDL_EID4_POSN                                 0x4
#define _RXF3EIDL_EID4_POSITION                             0x4
#define _RXF3EIDL_EID4_SIZE                                 0x1
#define _RXF3EIDL_EID4_LENGTH                               0x1
#define _RXF3EIDL_EID4_MASK                                 0x10
#define _RXF3EIDL_EID5_POSN                                 0x5
#define _RXF3EIDL_EID5_POSITION                             0x5
#define _RXF3EIDL_EID5_SIZE                                 0x1
#define _RXF3EIDL_EID5_LENGTH                               0x1
#define _RXF3EIDL_EID5_MASK                                 0x20
#define _RXF3EIDL_EID6_POSN                                 0x6
#define _RXF3EIDL_EID6_POSITION                             0x6
#define _RXF3EIDL_EID6_SIZE                                 0x1
#define _RXF3EIDL_EID6_LENGTH                               0x1
#define _RXF3EIDL_EID6_MASK                                 0x40
#define _RXF3EIDL_EID7_POSN                                 0x7
#define _RXF3EIDL_EID7_POSITION                             0x7
#define _RXF3EIDL_EID7_SIZE                                 0x1
#define _RXF3EIDL_EID7_LENGTH                               0x1
#define _RXF3EIDL_EID7_MASK                                 0x80
#define _RXF3EIDL_RXF3EID0_POSN                             0x0
#define _RXF3EIDL_RXF3EID0_POSITION                         0x0
#define _RXF3EIDL_RXF3EID0_SIZE                             0x1
#define _RXF3EIDL_RXF3EID0_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID0_MASK                             0x1
#define _RXF3EIDL_RXF3EID1_POSN                             0x1
#define _RXF3EIDL_RXF3EID1_POSITION                         0x1
#define _RXF3EIDL_RXF3EID1_SIZE                             0x1
#define _RXF3EIDL_RXF3EID1_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID1_MASK                             0x2
#define _RXF3EIDL_RXF3EID2_POSN                             0x2
#define _RXF3EIDL_RXF3EID2_POSITION                         0x2
#define _RXF3EIDL_RXF3EID2_SIZE                             0x1
#define _RXF3EIDL_RXF3EID2_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID2_MASK                             0x4
#define _RXF3EIDL_RXF3EID3_POSN                             0x3
#define _RXF3EIDL_RXF3EID3_POSITION                         0x3
#define _RXF3EIDL_RXF3EID3_SIZE                             0x1
#define _RXF3EIDL_RXF3EID3_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID3_MASK                             0x8
#define _RXF3EIDL_RXF3EID4_POSN                             0x4
#define _RXF3EIDL_RXF3EID4_POSITION                         0x4
#define _RXF3EIDL_RXF3EID4_SIZE                             0x1
#define _RXF3EIDL_RXF3EID4_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID4_MASK                             0x10
#define _RXF3EIDL_RXF3EID5_POSN                             0x5
#define _RXF3EIDL_RXF3EID5_POSITION                         0x5
#define _RXF3EIDL_RXF3EID5_SIZE                             0x1
#define _RXF3EIDL_RXF3EID5_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID5_MASK                             0x20
#define _RXF3EIDL_RXF3EID6_POSN                             0x6
#define _RXF3EIDL_RXF3EID6_POSITION                         0x6
#define _RXF3EIDL_RXF3EID6_SIZE                             0x1
#define _RXF3EIDL_RXF3EID6_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID6_MASK                             0x40
#define _RXF3EIDL_RXF3EID7_POSN                             0x7
#define _RXF3EIDL_RXF3EID7_POSITION                         0x7
#define _RXF3EIDL_RXF3EID7_SIZE                             0x1
#define _RXF3EIDL_RXF3EID7_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID7_MASK                             0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF3EID0               :1;
        unsigned RXF3EID1               :1;
        unsigned RXF3EID2               :1;
        unsigned RXF3EID3               :1;
        unsigned RXF3EID4               :1;
        unsigned RXF3EID5               :1;
        unsigned RXF3EID6               :1;
        unsigned RXF3EID7               :1;
    };
} RXF3EID0bits_t;
