MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
// Register: RXM1EIDH
#define RXM1EIDH RXM1EIDH
extern volatile unsigned char           RXM1EIDH            __at(0xF1E);
#ifndef _LIB_BUILD
asm("RXM1EIDH equ 0F1Eh");
#endif
// aliases
extern volatile unsigned char           RXM1EID8            __at(0xF1E);
#ifndef _LIB_BUILD
asm("RXM1EID8 equ 0F1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM1EID8               :1;
        unsigned RXM1EID9               :1;
        unsigned RXM1EID10              :1;
        unsigned RXM1EID11              :1;
        unsigned RXM1EID12              :1;
        unsigned RXM1EID13              :1;
        unsigned RXM1EID14              :1;
        unsigned RXM1EID15              :1;
    };
} RXM1EIDHbits_t;
extern volatile RXM1EIDHbits_t RXM1EIDHbits __at(0xF1E);
// bitfield macros
#define _RXM1EIDH_EID8_POSN                                 0x0
#define _RXM1EIDH_EID8_POSITION                             0x0
#define _RXM1EIDH_EID8_SIZE                                 0x1
#define _RXM1EIDH_EID8_LENGTH                               0x1
#define _RXM1EIDH_EID8_MASK                                 0x1
#define _RXM1EIDH_EID9_POSN                                 0x1
#define _RXM1EIDH_EID9_POSITION                             0x1
#define _RXM1EIDH_EID9_SIZE                                 0x1
#define _RXM1EIDH_EID9_LENGTH                               0x1
#define _RXM1EIDH_EID9_MASK                                 0x2
#define _RXM1EIDH_EID10_POSN                                0x2
#define _RXM1EIDH_EID10_POSITION                            0x2
#define _RXM1EIDH_EID10_SIZE                                0x1
#define _RXM1EIDH_EID10_LENGTH                              0x1
#define _RXM1EIDH_EID10_MASK                                0x4
#define _RXM1EIDH_EID11_POSN                                0x3
#define _RXM1EIDH_EID11_POSITION                            0x3
#define _RXM1EIDH_EID11_SIZE                                0x1
#define _RXM1EIDH_EID11_LENGTH                              0x1
#define _RXM1EIDH_EID11_MASK                                0x8
#define _RXM1EIDH_EID12_POSN                                0x4
#define _RXM1EIDH_EID12_POSITION                            0x4
#define _RXM1EIDH_EID12_SIZE                                0x1
#define _RXM1EIDH_EID12_LENGTH                              0x1
#define _RXM1EIDH_EID12_MASK                                0x10
#define _RXM1EIDH_EID13_POSN                                0x5
#define _RXM1EIDH_EID13_POSITION                            0x5
#define _RXM1EIDH_EID13_SIZE                                0x1
#define _RXM1EIDH_EID13_LENGTH                              0x1
#define _RXM1EIDH_EID13_MASK                                0x20
#define _RXM1EIDH_EID14_POSN                                0x6
#define _RXM1EIDH_EID14_POSITION                            0x6
#define _RXM1EIDH_EID14_SIZE                                0x1
#define _RXM1EIDH_EID14_LENGTH                              0x1
#define _RXM1EIDH_EID14_MASK                                0x40
#define _RXM1EIDH_EID15_POSN                                0x7
#define _RXM1EIDH_EID15_POSITION                            0x7
#define _RXM1EIDH_EID15_SIZE                                0x1
#define _RXM1EIDH_EID15_LENGTH                              0x1
#define _RXM1EIDH_EID15_MASK                                0x80
#define _RXM1EIDH_RXM1EID8_POSN                             0x0
#define _RXM1EIDH_RXM1EID8_POSITION                         0x0
#define _RXM1EIDH_RXM1EID8_SIZE                             0x1
#define _RXM1EIDH_RXM1EID8_LENGTH                           0x1
#define _RXM1EIDH_RXM1EID8_MASK                             0x1
#define _RXM1EIDH_RXM1EID9_POSN                             0x1
#define _RXM1EIDH_RXM1EID9_POSITION                         0x1
#define _RXM1EIDH_RXM1EID9_SIZE                             0x1
#define _RXM1EIDH_RXM1EID9_LENGTH                           0x1
#define _RXM1EIDH_RXM1EID9_MASK                             0x2
#define _RXM1EIDH_RXM1EID10_POSN                            0x2
#define _RXM1EIDH_RXM1EID10_POSITION                        0x2
#define _RXM1EIDH_RXM1EID10_SIZE                            0x1
#define _RXM1EIDH_RXM1EID10_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID10_MASK                            0x4
#define _RXM1EIDH_RXM1EID11_POSN                            0x3
#define _RXM1EIDH_RXM1EID11_POSITION                        0x3
#define _RXM1EIDH_RXM1EID11_SIZE                            0x1
#define _RXM1EIDH_RXM1EID11_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID11_MASK                            0x8
#define _RXM1EIDH_RXM1EID12_POSN                            0x4
#define _RXM1EIDH_RXM1EID12_POSITION                        0x4
#define _RXM1EIDH_RXM1EID12_SIZE                            0x1
#define _RXM1EIDH_RXM1EID12_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID12_MASK                            0x10
#define _RXM1EIDH_RXM1EID13_POSN                            0x5
#define _RXM1EIDH_RXM1EID13_POSITION                        0x5
#define _RXM1EIDH_RXM1EID13_SIZE                            0x1
#define _RXM1EIDH_RXM1EID13_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID13_MASK                            0x20
#define _RXM1EIDH_RXM1EID14_POSN                            0x6
#define _RXM1EIDH_RXM1EID14_POSITION                        0x6
#define _RXM1EIDH_RXM1EID14_SIZE                            0x1
#define _RXM1EIDH_RXM1EID14_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID14_MASK                            0x40
#define _RXM1EIDH_RXM1EID15_POSN                            0x7
#define _RXM1EIDH_RXM1EID15_POSITION                        0x7
#define _RXM1EIDH_RXM1EID15_SIZE                            0x1
#define _RXM1EIDH_RXM1EID15_LENGTH                          0x1
#define _RXM1EIDH_RXM1EID15_MASK                            0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM1EID8               :1;
        unsigned RXM1EID9               :1;
        unsigned RXM1EID10              :1;
        unsigned RXM1EID11              :1;
        unsigned RXM1EID12              :1;
        unsigned RXM1EID13              :1;
        unsigned RXM1EID14              :1;
        unsigned RXM1EID15              :1;
    };
} RXM1EID8bits_t;
