MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
extern volatile TXB2D7bits_t TXB2D7bits __at(0xF2D);
// bitfield macros
#define _TXB2D7_TXB2D70_POSN                                0x0
#define _TXB2D7_TXB2D70_POSITION                            0x0
#define _TXB2D7_TXB2D70_SIZE                                0x1
#define _TXB2D7_TXB2D70_LENGTH                              0x1
#define _TXB2D7_TXB2D70_MASK                                0x1
#define _TXB2D7_TXB2D71_POSN                                0x1
#define _TXB2D7_TXB2D71_POSITION                            0x1
#define _TXB2D7_TXB2D71_SIZE                                0x1
#define _TXB2D7_TXB2D71_LENGTH                              0x1
#define _TXB2D7_TXB2D71_MASK                                0x2
#define _TXB2D7_TXB2D72_POSN                                0x2
#define _TXB2D7_TXB2D72_POSITION                            0x2
#define _TXB2D7_TXB2D72_SIZE                                0x1
#define _TXB2D7_TXB2D72_LENGTH                              0x1
#define _TXB2D7_TXB2D72_MASK                                0x4
#define _TXB2D7_TXB2D73_POSN                                0x3
#define _TXB2D7_TXB2D73_POSITION                            0x3
#define _TXB2D7_TXB2D73_SIZE                                0x1
#define _TXB2D7_TXB2D73_LENGTH                              0x1
#define _TXB2D7_TXB2D73_MASK                                0x8
#define _TXB2D7_TXB2D74_POSN                                0x4
#define _TXB2D7_TXB2D74_POSITION                            0x4
#define _TXB2D7_TXB2D74_SIZE                                0x1
#define _TXB2D7_TXB2D74_LENGTH                              0x1
#define _TXB2D7_TXB2D74_MASK                                0x10
#define _TXB2D7_TXB2D75_POSN                                0x5
#define _TXB2D7_TXB2D75_POSITION                            0x5
#define _TXB2D7_TXB2D75_SIZE                                0x1
#define _TXB2D7_TXB2D75_LENGTH                              0x1
#define _TXB2D7_TXB2D75_MASK                                0x20
#define _TXB2D7_TXB2D76_POSN                                0x6
#define _TXB2D7_TXB2D76_POSITION                            0x6
#define _TXB2D7_TXB2D76_SIZE                                0x1
#define _TXB2D7_TXB2D76_LENGTH                              0x1
#define _TXB2D7_TXB2D76_MASK                                0x40
#define _TXB2D7_TXB2D77_POSN                                0x7
#define _TXB2D7_TXB2D77_POSITION                            0x7
#define _TXB2D7_TXB2D77_SIZE                                0x1
#define _TXB2D7_TXB2D77_LENGTH                              0x1
#define _TXB2D7_TXB2D77_MASK                                0x80

// Register: CANSTATRO3
#define CANSTATRO3 CANSTATRO3
extern volatile unsigned char           CANSTATRO3          __at(0xF2E);
#ifndef _LIB_BUILD
asm("CANSTATRO3 equ 0F2Eh");
#endif
// aliases
extern volatile unsigned char           CANSTAT_R04         __at(0xF2E);
#ifndef _LIB_BUILD
asm("CANSTAT_R04 equ 0F2Eh");
#endif
extern volatile unsigned char           CANSTAT_RO4         __at(0xF2E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO4 equ 0F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTATRO3bits_t;
extern volatile CANSTATRO3bits_t CANSTATRO3bits __at(0xF2E);
// bitfield macros
#define _CANSTATRO3_ICODE0_POSN                             0x1
#define _CANSTATRO3_ICODE0_POSITION                         0x1
#define _CANSTATRO3_ICODE0_SIZE                             0x1
#define _CANSTATRO3_ICODE0_LENGTH                           0x1
#define _CANSTATRO3_ICODE0_MASK                             0x2
#define _CANSTATRO3_ICODE1_POSN                             0x2
#define _CANSTATRO3_ICODE1_POSITION                         0x2
#define _CANSTATRO3_ICODE1_SIZE                             0x1
#define _CANSTATRO3_ICODE1_LENGTH                           0x1
#define _CANSTATRO3_ICODE1_MASK                             0x4
#define _CANSTATRO3_ICODE2_POSN                             0x3
#define _CANSTATRO3_ICODE2_POSITION                         0x3
#define _CANSTATRO3_ICODE2_SIZE                             0x1
#define _CANSTATRO3_ICODE2_LENGTH                           0x1
#define _CANSTATRO3_ICODE2_MASK                             0x8
#define _CANSTATRO3_OPMODE0_POSN                            0x5
#define _CANSTATRO3_OPMODE0_POSITION                        0x5
#define _CANSTATRO3_OPMODE0_SIZE                            0x1
#define _CANSTATRO3_OPMODE0_LENGTH                          0x1
#define _CANSTATRO3_OPMODE0_MASK                            0x20
#define _CANSTATRO3_OPMODE1_POSN                            0x6
#define _CANSTATRO3_OPMODE1_POSITION                        0x6
#define _CANSTATRO3_OPMODE1_SIZE                            0x1
#define _CANSTATRO3_OPMODE1_LENGTH                          0x1
#define _CANSTATRO3_OPMODE1_MASK                            0x40
#define _CANSTATRO3_OPMODE2_POSN                            0x7
#define _CANSTATRO3_OPMODE2_POSITION                        0x7
#define _CANSTATRO3_OPMODE2_SIZE                            0x1
#define _CANSTATRO3_OPMODE2_LENGTH                          0x1
#define _CANSTATRO3_OPMODE2_MASK                            0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTAT_R04bits_t;
extern volatile CANSTAT_R04bits_t CANSTAT_R04bits __at(0xF2E);
// bitfield macros
#define _CANSTAT_R04_ICODE0_POSN                            0x1
#define _CANSTAT_R04_ICODE0_POSITION                        0x1
#define _CANSTAT_R04_ICODE0_SIZE                            0x1
#define _CANSTAT_R04_ICODE0_LENGTH                          0x1
#define _CANSTAT_R04_ICODE0_MASK                            0x2
#define _CANSTAT_R04_ICODE1_POSN                            0x2
#define _CANSTAT_R04_ICODE1_POSITION                        0x2
#define _CANSTAT_R04_ICODE1_SIZE                            0x1
#define _CANSTAT_R04_ICODE1_LENGTH                          0x1
#define _CANSTAT_R04_ICODE1_MASK                            0x4
#define _CANSTAT_R04_ICODE2_POSN                            0x3
#define _CANSTAT_R04_ICODE2_POSITION                        0x3
#define _CANSTAT_R04_ICODE2_SIZE                            0x1
#define _CANSTAT_R04_ICODE2_LENGTH                          0x1
#define _CANSTAT_R04_ICODE2_MASK                            0x8
#define _CANSTAT_R04_OPMODE0_POSN                           0x5
#define _CANSTAT_R04_OPMODE0_POSITION                       0x5
#define _CANSTAT_R04_OPMODE0_SIZE                           0x1
#define _CANSTAT_R04_OPMODE0_LENGTH                         0x1
#define _CANSTAT_R04_OPMODE0_MASK                           0x20
#define _CANSTAT_R04_OPMODE1_POSN                           0x6
#define _CANSTAT_R04_OPMODE1_POSITION                       0x6
#define _CANSTAT_R04_OPMODE1_SIZE                           0x1
#define _CANSTAT_R04_OPMODE1_LENGTH                         0x1
#define _CANSTAT_R04_OPMODE1_MASK                           0x40
#define _CANSTAT_R04_OPMODE2_POSN                           0x7
#define _CANSTAT_R04_OPMODE2_POSITION                       0x7
#define _CANSTAT_R04_OPMODE2_SIZE                           0x1
#define _CANSTAT_R04_OPMODE2_LENGTH                         0x1
#define _CANSTAT_R04_OPMODE2_MASK                           0x80
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTAT_RO4bits_t;
extern volatile CANSTAT_RO4bits_t CANSTAT_RO4bits __at(0xF2E);
// bitfield macros
#define _CANSTAT_RO4_ICODE0_POSN                            0x1
#define _CANSTAT_RO4_ICODE0_POSITION                        0x1
#define _CANSTAT_RO4_ICODE0_SIZE                            0x1
#define _CANSTAT_RO4_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE0_MASK                            0x2
#define _CANSTAT_RO4_ICODE1_POSN                            0x2
#define _CANSTAT_RO4_ICODE1_POSITION                        0x2
#define _CANSTAT_RO4_ICODE1_SIZE                            0x1
#define _CANSTAT_RO4_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE1_MASK                            0x4
#define _CANSTAT_RO4_ICODE2_POSN                            0x3
#define _CANSTAT_RO4_ICODE2_POSITION                        0x3
#define _CANSTAT_RO4_ICODE2_SIZE                            0x1
#define _CANSTAT_RO4_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE2_MASK                            0x8
#define _CANSTAT_RO4_OPMODE0_POSN                           0x5
#define _CANSTAT_RO4_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO4_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE0_MASK                           0x20
#define _CANSTAT_RO4_OPMODE1_POSN                           0x6
#define _CANSTAT_RO4_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO4_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE1_MASK                           0x40
#define _CANSTAT_RO4_OPMODE2_POSN                           0x7
#define _CANSTAT_RO4_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO4_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE2_MASK                           0x80

// Register: TXB1CON
#define TXB1CON TXB1CON
extern volatile unsigned char           TXB1CON             __at(0xF30);
#ifndef _LIB_BUILD
asm("TXB1CON equ 0F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned                        :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
    };
    struct {
        unsigned TXB1PRI0               :1;
        unsigned TXB1PRI1               :1;
        unsigned                        :1;
        unsigned TXB1REQ                :1;
        unsigned TXB1ERR                :1;
        unsigned TXB1LARB               :1;
        unsigned TXB1ABT                :1;
    };
} TXB1CONbits_t;
extern volatile TXB1CONbits_t TXB1CONbits __at(0xF30);
// bitfield macros
#define _TXB1CON_TXPRI0_POSN                                0x0
#define _TXB1CON_TXPRI0_POSITION                            0x0
#define _TXB1CON_TXPRI0_SIZE                                0x1
#define _TXB1CON_TXPRI0_LENGTH                              0x1
#define _TXB1CON_TXPRI0_MASK                                0x1
#define _TXB1CON_TXPRI1_POSN                                0x1
#define _TXB1CON_TXPRI1_POSITION                            0x1
#define _TXB1CON_TXPRI1_SIZE                                0x1
#define _TXB1CON_TXPRI1_LENGTH                              0x1
#define _TXB1CON_TXPRI1_MASK                                0x2
#define _TXB1CON_TXREQ_POSN                                 0x3
#define _TXB1CON_TXREQ_POSITION                             0x3
#define _TXB1CON_TXREQ_SIZE                                 0x1
#define _TXB1CON_TXREQ_LENGTH                               0x1
#define _TXB1CON_TXREQ_MASK                                 0x8
#define _TXB1CON_TXERR_POSN                                 0x4
#define _TXB1CON_TXERR_POSITION                             0x4
#define _TXB1CON_TXERR_SIZE                                 0x1
#define _TXB1CON_TXERR_LENGTH                               0x1
#define _TXB1CON_TXERR_MASK                                 0x10
#define _TXB1CON_TXLARB_POSN                                0x5
#define _TXB1CON_TXLARB_POSITION                            0x5
#define _TXB1CON_TXLARB_SIZE                                0x1
#define _TXB1CON_TXLARB_LENGTH                              0x1
#define _TXB1CON_TXLARB_MASK                                0x20
#define _TXB1CON_TXABT_POSN                                 0x6
#define _TXB1CON_TXABT_POSITION                             0x6
#define _TXB1CON_TXABT_SIZE                                 0x1
#define _TXB1CON_TXABT_LENGTH                               0x1
#define _TXB1CON_TXABT_MASK                                 0x40
#define _TXB1CON_TXB1PRI0_POSN                              0x0
#define _TXB1CON_TXB1PRI0_POSITION                          0x0
#define _TXB1CON_TXB1PRI0_SIZE                              0x1
#define _TXB1CON_TXB1PRI0_LENGTH                            0x1
#define _TXB1CON_TXB1PRI0_MASK                              0x1
#define _TXB1CON_TXB1PRI1_POSN                              0x1
#define _TXB1CON_TXB1PRI1_POSITION                          0x1
#define _TXB1CON_TXB1PRI1_SIZE                              0x1
#define _TXB1CON_TXB1PRI1_LENGTH                            0x1
#define _TXB1CON_TXB1PRI1_MASK                              0x2
#define _TXB1CON_TXB1REQ_POSN                               0x3
#define _TXB1CON_TXB1REQ_POSITION                           0x3
#define _TXB1CON_TXB1REQ_SIZE                               0x1
#define _TXB1CON_TXB1REQ_LENGTH                             0x1
#define _TXB1CON_TXB1REQ_MASK                               0x8
#define _TXB1CON_TXB1ERR_POSN                               0x4
#define _TXB1CON_TXB1ERR_POSITION                           0x4
#define _TXB1CON_TXB1ERR_SIZE                               0x1
#define _TXB1CON_TXB1ERR_LENGTH                             0x1
#define _TXB1CON_TXB1ERR_MASK                               0x10
#define _TXB1CON_TXB1LARB_POSN                              0x5
#define _TXB1CON_TXB1LARB_POSITION                          0x5
#define _TXB1CON_TXB1LARB_SIZE                              0x1
#define _TXB1CON_TXB1LARB_LENGTH                            0x1
#define _TXB1CON_TXB1LARB_MASK                              0x20
#define _TXB1CON_TXB1ABT_POSN                               0x6
#define _TXB1CON_TXB1ABT_POSITION                           0x6
#define _TXB1CON_TXB1ABT_SIZE                               0x1
#define _TXB1CON_TXB1ABT_LENGTH                             0x1
#define _TXB1CON_TXB1ABT_MASK                               0x40

// Register: TXB1SIDH
#define TXB1SIDH TXB1SIDH
extern volatile unsigned char           TXB1SIDH            __at(0xF31);
#ifndef _LIB_BUILD
asm("TXB1SIDH equ 0F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned TXB1SID3               :1;
        unsigned TXB1SID4               :1;
        unsigned TXB1SID5               :1;
        unsigned TXB1SID6               :1;
        unsigned TXB1SID7               :1;
        unsigned TXB1SID8               :1;
        unsigned TXB1SID9               :1;
        unsigned TXB1SID10              :1;
    };
} TXB1SIDHbits_t;
