MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
// Register: TXB1D7
#define TXB1D7 TXB1D7
extern volatile unsigned char           TXB1D7              __at(0xF3D);
#ifndef _LIB_BUILD
asm("TXB1D7 equ 0F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D70                :1;
        unsigned TXB1D71                :1;
        unsigned TXB1D72                :1;
        unsigned TXB1D73                :1;
        unsigned TXB1D74                :1;
        unsigned TXB1D75                :1;
        unsigned TXB1D76                :1;
        unsigned TXB1D77                :1;
    };
} TXB1D7bits_t;
extern volatile TXB1D7bits_t TXB1D7bits __at(0xF3D);
// bitfield macros
#define _TXB1D7_TXB1D70_POSN                                0x0
#define _TXB1D7_TXB1D70_POSITION                            0x0
#define _TXB1D7_TXB1D70_SIZE                                0x1
#define _TXB1D7_TXB1D70_LENGTH                              0x1
#define _TXB1D7_TXB1D70_MASK                                0x1
#define _TXB1D7_TXB1D71_POSN                                0x1
#define _TXB1D7_TXB1D71_POSITION                            0x1
#define _TXB1D7_TXB1D71_SIZE                                0x1
#define _TXB1D7_TXB1D71_LENGTH                              0x1
#define _TXB1D7_TXB1D71_MASK                                0x2
#define _TXB1D7_TXB1D72_POSN                                0x2
#define _TXB1D7_TXB1D72_POSITION                            0x2
#define _TXB1D7_TXB1D72_SIZE                                0x1
#define _TXB1D7_TXB1D72_LENGTH                              0x1
#define _TXB1D7_TXB1D72_MASK                                0x4
#define _TXB1D7_TXB1D73_POSN                                0x3
#define _TXB1D7_TXB1D73_POSITION                            0x3
#define _TXB1D7_TXB1D73_SIZE                                0x1
#define _TXB1D7_TXB1D73_LENGTH                              0x1
#define _TXB1D7_TXB1D73_MASK                                0x8
#define _TXB1D7_TXB1D74_POSN                                0x4
#define _TXB1D7_TXB1D74_POSITION                            0x4
#define _TXB1D7_TXB1D74_SIZE                                0x1
#define _TXB1D7_TXB1D74_LENGTH                              0x1
#define _TXB1D7_TXB1D74_MASK                                0x10
#define _TXB1D7_TXB1D75_POSN                                0x5
#define _TXB1D7_TXB1D75_POSITION                            0x5
#define _TXB1D7_TXB1D75_SIZE                                0x1
#define _TXB1D7_TXB1D75_LENGTH                              0x1
#define _TXB1D7_TXB1D75_MASK                                0x20
#define _TXB1D7_TXB1D76_POSN                                0x6
#define _TXB1D7_TXB1D76_POSITION                            0x6
#define _TXB1D7_TXB1D76_SIZE                                0x1
#define _TXB1D7_TXB1D76_LENGTH                              0x1
#define _TXB1D7_TXB1D76_MASK                                0x40
#define _TXB1D7_TXB1D77_POSN                                0x7
#define _TXB1D7_TXB1D77_POSITION                            0x7
#define _TXB1D7_TXB1D77_SIZE                                0x1
#define _TXB1D7_TXB1D77_LENGTH                              0x1
#define _TXB1D7_TXB1D77_MASK                                0x80

// Register: CANSTATRO2
#define CANSTATRO2 CANSTATRO2
extern volatile unsigned char           CANSTATRO2          __at(0xF3E);
#ifndef _LIB_BUILD
asm("CANSTATRO2 equ 0F3Eh");
#endif
// aliases
extern volatile unsigned char           CANSTAT_R03         __at(0xF3E);
#ifndef _LIB_BUILD
asm("CANSTAT_R03 equ 0F3Eh");
#endif
extern volatile unsigned char           CANSTAT_RO3         __at(0xF3E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO3 equ 0F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTATRO2bits_t;
extern volatile CANSTATRO2bits_t CANSTATRO2bits __at(0xF3E);
// bitfield macros
#define _CANSTATRO2_ICODE0_POSN                             0x1
#define _CANSTATRO2_ICODE0_POSITION                         0x1
#define _CANSTATRO2_ICODE0_SIZE                             0x1
#define _CANSTATRO2_ICODE0_LENGTH                           0x1
#define _CANSTATRO2_ICODE0_MASK                             0x2
#define _CANSTATRO2_ICODE1_POSN                             0x2
#define _CANSTATRO2_ICODE1_POSITION                         0x2
#define _CANSTATRO2_ICODE1_SIZE                             0x1
#define _CANSTATRO2_ICODE1_LENGTH                           0x1
#define _CANSTATRO2_ICODE1_MASK                             0x4
#define _CANSTATRO2_ICODE2_POSN                             0x3
#define _CANSTATRO2_ICODE2_POSITION                         0x3
#define _CANSTATRO2_ICODE2_SIZE                             0x1
#define _CANSTATRO2_ICODE2_LENGTH                           0x1
#define _CANSTATRO2_ICODE2_MASK                             0x8
#define _CANSTATRO2_OPMODE0_POSN                            0x5
#define _CANSTATRO2_OPMODE0_POSITION                        0x5
#define _CANSTATRO2_OPMODE0_SIZE                            0x1
#define _CANSTATRO2_OPMODE0_LENGTH                          0x1
#define _CANSTATRO2_OPMODE0_MASK                            0x20
#define _CANSTATRO2_OPMODE1_POSN                            0x6
#define _CANSTATRO2_OPMODE1_POSITION                        0x6
#define _CANSTATRO2_OPMODE1_SIZE                            0x1
#define _CANSTATRO2_OPMODE1_LENGTH                          0x1
#define _CANSTATRO2_OPMODE1_MASK                            0x40
#define _CANSTATRO2_OPMODE2_POSN                            0x7
#define _CANSTATRO2_OPMODE2_POSITION                        0x7
#define _CANSTATRO2_OPMODE2_SIZE                            0x1
#define _CANSTATRO2_OPMODE2_LENGTH                          0x1
#define _CANSTATRO2_OPMODE2_MASK                            0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
} CANSTAT_R03bits_t;
