MikroElektronika/core_packages/PIC/XC8/def/PIC18C658/mcu.h
extern volatile TXSTAbits_t TXSTAbits __at(0xFAC);
// bitfield macros
#define _TXSTA_TX9D_POSN                                    0x0
#define _TXSTA_TX9D_POSITION                                0x0
#define _TXSTA_TX9D_SIZE                                    0x1
#define _TXSTA_TX9D_LENGTH                                  0x1
#define _TXSTA_TX9D_MASK                                    0x1
#define _TXSTA_TRMT_POSN                                    0x1
#define _TXSTA_TRMT_POSITION                                0x1
#define _TXSTA_TRMT_SIZE                                    0x1
#define _TXSTA_TRMT_LENGTH                                  0x1
#define _TXSTA_TRMT_MASK                                    0x2
#define _TXSTA_BRGH_POSN                                    0x2
#define _TXSTA_BRGH_POSITION                                0x2
#define _TXSTA_BRGH_SIZE                                    0x1
#define _TXSTA_BRGH_LENGTH                                  0x1
#define _TXSTA_BRGH_MASK                                    0x4
#define _TXSTA_SYNC_POSN                                    0x4
#define _TXSTA_SYNC_POSITION                                0x4
#define _TXSTA_SYNC_SIZE                                    0x1
#define _TXSTA_SYNC_LENGTH                                  0x1
#define _TXSTA_SYNC_MASK                                    0x10
#define _TXSTA_TXEN_POSN                                    0x5
#define _TXSTA_TXEN_POSITION                                0x5
#define _TXSTA_TXEN_SIZE                                    0x1
#define _TXSTA_TXEN_LENGTH                                  0x1
#define _TXSTA_TXEN_MASK                                    0x20
#define _TXSTA_TX9_POSN                                     0x6
#define _TXSTA_TX9_POSITION                                 0x6
#define _TXSTA_TX9_SIZE                                     0x1
#define _TXSTA_TX9_LENGTH                                   0x1
#define _TXSTA_TX9_MASK                                     0x40
#define _TXSTA_CSRC_POSN                                    0x7
#define _TXSTA_CSRC_POSITION                                0x7
#define _TXSTA_CSRC_SIZE                                    0x1
#define _TXSTA_CSRC_LENGTH                                  0x1
#define _TXSTA_CSRC_MASK                                    0x80
#define _TXSTA_TX9D1_POSN                                   0x0
#define _TXSTA_TX9D1_POSITION                               0x0
#define _TXSTA_TX9D1_SIZE                                   0x1
#define _TXSTA_TX9D1_LENGTH                                 0x1
#define _TXSTA_TX9D1_MASK                                   0x1
#define _TXSTA_TRMT1_POSN                                   0x1
#define _TXSTA_TRMT1_POSITION                               0x1
#define _TXSTA_TRMT1_SIZE                                   0x1
#define _TXSTA_TRMT1_LENGTH                                 0x1
#define _TXSTA_TRMT1_MASK                                   0x2
#define _TXSTA_BRGH1_POSN                                   0x2
#define _TXSTA_BRGH1_POSITION                               0x2
#define _TXSTA_BRGH1_SIZE                                   0x1
#define _TXSTA_BRGH1_LENGTH                                 0x1
#define _TXSTA_BRGH1_MASK                                   0x4
#define _TXSTA_SYNC1_POSN                                   0x4
#define _TXSTA_SYNC1_POSITION                               0x4
#define _TXSTA_SYNC1_SIZE                                   0x1
#define _TXSTA_SYNC1_LENGTH                                 0x1
#define _TXSTA_SYNC1_MASK                                   0x10
#define _TXSTA_TXEN1_POSN                                   0x5
#define _TXSTA_TXEN1_POSITION                               0x5
#define _TXSTA_TXEN1_SIZE                                   0x1
#define _TXSTA_TXEN1_LENGTH                                 0x1
#define _TXSTA_TXEN1_MASK                                   0x20
#define _TXSTA_TX91_POSN                                    0x6
#define _TXSTA_TX91_POSITION                                0x6
#define _TXSTA_TX91_SIZE                                    0x1
#define _TXSTA_TX91_LENGTH                                  0x1
#define _TXSTA_TX91_MASK                                    0x40
#define _TXSTA_CSRC1_POSN                                   0x7
#define _TXSTA_CSRC1_POSITION                               0x7
#define _TXSTA_CSRC1_SIZE                                   0x1
#define _TXSTA_CSRC1_LENGTH                                 0x1
#define _TXSTA_CSRC1_MASK                                   0x80
#define _TXSTA_TX8_9_POSN                                   0x6
#define _TXSTA_TX8_9_POSITION                               0x6
#define _TXSTA_TX8_9_SIZE                                   0x1
#define _TXSTA_TX8_9_LENGTH                                 0x1
#define _TXSTA_TX8_9_MASK                                   0x40
#define _TXSTA_TXD8_POSN                                    0x0
#define _TXSTA_TXD8_POSITION                                0x0
#define _TXSTA_TXD8_SIZE                                    0x1
#define _TXSTA_TXD8_LENGTH                                  0x1
#define _TXSTA_TXD8_MASK                                    0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TX9D1                  :1;
        unsigned TRMT1                  :1;
        unsigned BRGH1                  :1;
        unsigned                        :1;
        unsigned SYNC1                  :1;
        unsigned TXEN1                  :1;
        unsigned TX91                   :1;
        unsigned CSRC1                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TX8_9                  :1;
    };
    struct {
        unsigned TXD8                   :1;
    };
} COM1STAbits_t;
extern volatile COM1STAbits_t COM1STAbits __at(0xFAC);
// bitfield macros
#define _COM1STA_TX9D_POSN                                  0x0
#define _COM1STA_TX9D_POSITION                              0x0
#define _COM1STA_TX9D_SIZE                                  0x1
#define _COM1STA_TX9D_LENGTH                                0x1
#define _COM1STA_TX9D_MASK                                  0x1
#define _COM1STA_TRMT_POSN                                  0x1
#define _COM1STA_TRMT_POSITION                              0x1
#define _COM1STA_TRMT_SIZE                                  0x1
#define _COM1STA_TRMT_LENGTH                                0x1
#define _COM1STA_TRMT_MASK                                  0x2
#define _COM1STA_BRGH_POSN                                  0x2
#define _COM1STA_BRGH_POSITION                              0x2
#define _COM1STA_BRGH_SIZE                                  0x1
#define _COM1STA_BRGH_LENGTH                                0x1
#define _COM1STA_BRGH_MASK                                  0x4
#define _COM1STA_SYNC_POSN                                  0x4
#define _COM1STA_SYNC_POSITION                              0x4
#define _COM1STA_SYNC_SIZE                                  0x1
#define _COM1STA_SYNC_LENGTH                                0x1
#define _COM1STA_SYNC_MASK                                  0x10
#define _COM1STA_TXEN_POSN                                  0x5
#define _COM1STA_TXEN_POSITION                              0x5
#define _COM1STA_TXEN_SIZE                                  0x1
#define _COM1STA_TXEN_LENGTH                                0x1
#define _COM1STA_TXEN_MASK                                  0x20
#define _COM1STA_TX9_POSN                                   0x6
#define _COM1STA_TX9_POSITION                               0x6
#define _COM1STA_TX9_SIZE                                   0x1
#define _COM1STA_TX9_LENGTH                                 0x1
#define _COM1STA_TX9_MASK                                   0x40
#define _COM1STA_CSRC_POSN                                  0x7
#define _COM1STA_CSRC_POSITION                              0x7
#define _COM1STA_CSRC_SIZE                                  0x1
#define _COM1STA_CSRC_LENGTH                                0x1
#define _COM1STA_CSRC_MASK                                  0x80
#define _COM1STA_TX9D1_POSN                                 0x0
#define _COM1STA_TX9D1_POSITION                             0x0
#define _COM1STA_TX9D1_SIZE                                 0x1
#define _COM1STA_TX9D1_LENGTH                               0x1
#define _COM1STA_TX9D1_MASK                                 0x1
#define _COM1STA_TRMT1_POSN                                 0x1
#define _COM1STA_TRMT1_POSITION                             0x1
#define _COM1STA_TRMT1_SIZE                                 0x1
#define _COM1STA_TRMT1_LENGTH                               0x1
#define _COM1STA_TRMT1_MASK                                 0x2
#define _COM1STA_BRGH1_POSN                                 0x2
#define _COM1STA_BRGH1_POSITION                             0x2
#define _COM1STA_BRGH1_SIZE                                 0x1
#define _COM1STA_BRGH1_LENGTH                               0x1
#define _COM1STA_BRGH1_MASK                                 0x4
#define _COM1STA_SYNC1_POSN                                 0x4
#define _COM1STA_SYNC1_POSITION                             0x4
#define _COM1STA_SYNC1_SIZE                                 0x1
#define _COM1STA_SYNC1_LENGTH                               0x1
#define _COM1STA_SYNC1_MASK                                 0x10
#define _COM1STA_TXEN1_POSN                                 0x5
#define _COM1STA_TXEN1_POSITION                             0x5
#define _COM1STA_TXEN1_SIZE                                 0x1
#define _COM1STA_TXEN1_LENGTH                               0x1
#define _COM1STA_TXEN1_MASK                                 0x20
#define _COM1STA_TX91_POSN                                  0x6
#define _COM1STA_TX91_POSITION                              0x6
#define _COM1STA_TX91_SIZE                                  0x1
#define _COM1STA_TX91_LENGTH                                0x1
#define _COM1STA_TX91_MASK                                  0x40
#define _COM1STA_CSRC1_POSN                                 0x7
#define _COM1STA_CSRC1_POSITION                             0x7
#define _COM1STA_CSRC1_SIZE                                 0x1
#define _COM1STA_CSRC1_LENGTH                               0x1
#define _COM1STA_CSRC1_MASK                                 0x80
#define _COM1STA_TX8_9_POSN                                 0x6
#define _COM1STA_TX8_9_POSITION                             0x6
#define _COM1STA_TX8_9_SIZE                                 0x1
#define _COM1STA_TX8_9_LENGTH                               0x1
#define _COM1STA_TX8_9_MASK                                 0x40
#define _COM1STA_TXD8_POSN                                  0x0
#define _COM1STA_TXD8_POSITION                              0x0
#define _COM1STA_TXD8_SIZE                                  0x1
#define _COM1STA_TXD8_LENGTH                                0x1
#define _COM1STA_TXD8_MASK                                  0x1
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TX9D1                  :1;
        unsigned TRMT1                  :1;
        unsigned BRGH1                  :1;
        unsigned                        :1;
        unsigned SYNC1                  :1;
        unsigned TXEN1                  :1;
        unsigned TX91                   :1;
        unsigned CSRC1                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TX8_9                  :1;
    };
    struct {
        unsigned TXD8                   :1;
    };
} TXSTA1bits_t;
